{
    "intents": [
        {
            "tag": "personal_loan",
            "patterns": [
                "how can i apply for personal loan",
                "I want to apply for personal loan",
                "I would like to apply for personal loan",
                "where can i apply for personal loan",
                "application for personal loan",
                "personal loan application"
            ],
            "responses": [
                "Please click here to apply for personal loan"
            ],
            "context_set": ""
        },
        {
            "tag": "business_loan",
            "patterns": [
                "how can i apply for business loan",
                "I want to apply for business loan",
                "I would like to apply for business loan",
                "where can i apply for business loan",
                "application for business loan",
                "business loan application"
            ],
            "responses": [
                "Please click here to apply for business loan"
            ]
        },
        {
            "tag": "personal_loan_amount",
            "patterns": [
                "what is the amount of personal loan i can avail",
                "personal loan amount",
                "i would like to know the personal loan amount i can get",
                "what is the maximum personal loan amount",
                "can i know the personal loan amount i can get",
                "can you share the personal loan amount i can avail",
                "amount of personal loan"
            ],
            "responses": [
                "Please click here to know max and min amount for personal loan"
            ]
        },
        {
            "tag": "business_loan_amount",
            "patterns": [
                "what is the amount of business loan i can avail",
                "business loan amount",
                "i would like to know the business loan amount i can get",
                "what is the maximum business loan amount",
                "can i know the business loan amount i can get",
                "can you share the business loan amount i can avail",
                "amount of business loan"
            ],
            "responses": [
                "Please click here to know max and min amount for business loan"
            ]
        },
        {
            "tag": "credit_card",
            "patterns": [
                "how can I apply for a credit card",
                "I want to apply for credit cards",
                "I would like to apply for credit cards",
                "I would like to apply for credit card",
                "credit card application",
                "Can you help with the procedure for applying a credit card",
                "please help with credit card application details"
            ],
            "responses": [
                "Please click here to know the procedure to apply for credit card"
            ]
        },
        {
            "tag": "debit_card",
            "patterns": [
                "how can I apply for a debit card",
                "I want to apply for debit cards",
                "I would like to apply for debit cards",
                "I would like to apply for debit card",
                "debit card application",
                "Can you help with the procedure for applying a debit card",
                "please help with debit card application details"
            ],
            "responses": [
                "Please click here to know the procedure to apply for debit card"
            ]
        },
        {
            "tag": "credit_card_addon",
            "patterns": [
                "i want an addon for my credit card",
                "credit card addon",
                "can i get a credit card add on",
                "i would like to get an add on for my credit card",
                "what is the procedure to get a credit card addon",
                "how can i get a credit card add on",
                "i want a credit card add on",
                "please share the procedure to get credit card add on",
                "i want a credit card addon"
            ],
            "responses": [
                "Please click here to know the procedure for credit card addon"
            ]
        },
        {
            "tag": "debit_card_addon",
            "patterns": [
                "i want an addon for my debit card",
                "debit card addon",
                "can i get a debit card add on",
                "i would like to get an add on for my debit card",
                "what is the procedure to get a debit card addon",
                "how can i get a debit card add on",
                "i want a debit card add on",
                "please share the procedure to get debit card add on",
                "i want a debit card addon"
            ],
            "responses": [
                "Please click here to know the procedure for debit card addon"
            ]
        },
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "How are you",
                "Is anyone there?",
                "Hello",
                "Good day"
            ],
            "responses": [
                "Hi there, how can I help?"
            ],
            "context_set": ""
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later",
                "Goodbye"
            ],
            "responses": [
                "See you later, thanks for visiting",
                "Have a nice day",
                "Bye! Come back again soon."
            ]
        }
    ]
}